# IsIdentity Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Transform1D..::..IsIdentity Property
Transform1D Class See Also
---
The boolean value that indicates whether this transformation is an identity.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public bool IsIdentity { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsIdentity As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsIdentity {
	bool get ();
}
```

# Remarks
The identity transformation does not change a point or a vector that it is applied to.
# See Also
Transform1D Class
Autodesk.Revit.DB Namespace